[
  {
    "title": "1",
    "order": "1",
    "rank": "1",
    "name": "April 5, 2014: HAT TRICK VS. PORTLAND ",
    "chatter": "<p>Clint Dempsey and his Sounders were still reeling after being eliminated by the Portland Timbers in the 2013 playoffs. Now, the 2014 regular season was in its infancy and Dempsey, with just one Sounders goal to his credit since transferring over from England, had yet to show the form that had made him such a celebrated player internationally.</p><p>\n \nThat changed on this day, as Dempsey’s hat trick not only opened his account against the Timbers, it also launched the team toward its finest regular season ever. Dempsey’s first goal evened the match 2-2 but his team was down 4-2 with just over five minutes remaining when his legend in this Cascadia derby was firmly cemented.</p><p>\n \nLamar Neagle had worked the ball out from the right corner and fired a cross into the 18-yard box. Obafemi Martins made a nifty flick to Dempsey, who knocked the ball down with his knee, then fired a right-footed blast into the net to make it a 4-3 game.</p><p>\nThe Sounders kept pouring it on and, less than a minute later, DeAndre Yedlin was tripped in the box by Ben Zemanski. Dempsey lined up for the penalty kick and promptly shot left while goalkeeper Andrew Weber dove to his right.</p><p>\n  \n“When he scored those three goals in Portland, that was a good memory for me,’’ longtime teammate Osvaldo Alonso said Wednesday when asked to recall his greatest on-field Dempsey moment. “Getting a hat trick at Portland isn’t easy.’’</p>",
    "image": "08292018_April5Dempsey_163042.jpg",
    "credit": "Don Ryan / The Seattle Times"
  },
  {
    "title": "2",
    "order": "2",
    "rank": "2",
    "name": "Sept. 16, 2014: A U.S. OPEN CUP WINNER",
    "chatter": "<p>After winning three consecutive Lamar Hunt U.S. Open Cup titles their first three seasons from 2009-2011, the Sounders lost the final on penalty kicks in 2012 and then were eliminated early on in 2013.</p><p>\n \nBut during a storied 2014 season that would lead to a Supporters Shield, the Sounders found themselves back in the Open final once again, this time in what was effectively a home game for the opposing Philadelphia Union at PPL Park in Chester, Pa.</p><p>\n \nPhiladelphia opened the scoring late in the first half, but Chad Barrett tied it early in the second. The game headed to extra time when, in the 101st minute, Dempsey and Obafemi Martins — who didn’t start the match because of a muscle strain — showed why they are considered one of the greatest 1-2 attack duos in league history.</p><p>\n \nDempsey took a pass across midfield and then hit Martins with a ball in stride. Martins moved right as Dempsey broke straight down the middle in a sprint toward the goal. The return pass from Martins caught Dempsey in the box, about 13 yards out, where he fired a left-footed blast to the near post by keeper Zac MacMath for the eventual winning goal.</p><p>\n \nMartins put the match away with a third Sounders goal three minutes later, but Dempsey would be named Man of the Match in winning his first-ever club trophy. Sounders coach Brian Schmetzer, an assistant on that 2014, said Wednesday the Open Cup performance ranks as his favorite Sounders moment for Dempsey.</p><p>\n \n“I thought Zack Scott had a monster game and Clint (Dempsey), Oba (Martins) and those guys, that was a big, big performance from those guys,’’ Schmetzer said.</p>",
    "image": "08292018_DempseySept16_163142.jpg",
    "credit": "Michael Perez / Associated Press"
  },
  {
    "title": "3",
    "order": "3",
    "rank": "3",
    "name": "Nov. 3, 2017: ELIMINATING VANCOUVER",
    "chatter": "<p>Dempsey had sat out the team’s title win in 2016, so he was on a bit of a mission in the 2017 postseason, as witnessed in the Western Conference semifinal against the Vancouver Whitecaps. The Whitecaps were upset Dempsey was even playing, having been red-carded in the regular season finale and then mocking referee Chris Penso but receiving no additional suspension from the league.</p><p>\n \nThe red card did cause Dempsey to automatically miss a scoreless, lackluster semifinal opener against the Whitecaps at B.C. Place Stadium. But then, with Dempsey back in the lineup, the teams returned to CenturyLink Field for the final leg and were again scoreless through the first half.</p><p>\n \nThings were getting tense indeed as the minutes ticked on and the pressure mounted for the home side. But then, Dempsey took over, opening the scoring in the 56th minute with a left-footed shot, top-shelf from 17 yards out.</p><p>\n \n“Once we got the first goal, it just opened up the game,’’ Dempsey said afterwards. “We just kept on getting better and better looks and could have had a few more.’’</p><p>\n \nThey instead had to settle for just one more, Dempsey taking a tremendous 88th-minute cross from Victor Rodriguez and leaping high in the air for a right-footed tip home. </p>",
    "image": "Nov32017Dempsey.jpg",
    "credit": "Ted S. Warren / Associated Press"
  },
  {
    "title": "4",
    "order": "4",
    "rank": "4",
    "name": "Aug. 21, 2016: KEEPING PLAYOFF DRIVE ALIVE",
    "chatter": "<p>The Sounders were assumed dead and buried by late July 2016, when coach Sigi Schmid was fired and replaced by Brian Schmetzer. But Nicolas Lodeiro was added soon after, and he, Dempsey and Jordan Morris proved a lethal attacking trio.</p><p>\n \nAfter going 2-0-1 their first three games under Schmetzer, the Sounders played host to the Portland Timbers at CenturyLink Field. By that point, it was still assumed the Sounders couldn’t lose another home game — especially to a Portland team ahead of them in the standings — if they wished to keep their postseason streak alive. But the Timbers weren’t making things easy, keeping things scoreless into the 62nd minute. But then, Cristian Roldan was hauled down inside the box and Dempsey – as he did so often in the Cascadia derby – took over the game, converting a penalty kick behind keeper Jake Gleeson to give his team a lead.</p><p>\n \nIn the 80th minute, Roldan fed Dempsey a pass on the left side and he beat Gleeson with a rolling shot to the far post. That made it 2-0, and the Sounders would go on to win 3-1.</p><p>\n \nThe Sounders didn’t lose another game at home, making the playoffs on the season’s final day and going on to win their first MLS Cup in stunning fashion. But they did it without Dempsey, who, soon after that win over Portland, was sidelined with what was later called an irregular heartbeat.</p>",
    "image": "Aug.212016Dempsey2.jpg",
    "credit": "Ted S. Warren / Associated Press"
  },
  {
    "title": "5",
    "order": "5",
    "rank": "5",
    "name": "June 16, 2015: “THE RED-CARD WEDDING”",
    "chatter": "<p>The 4,000 fans on hand for a fourth-round U.S. Open Cup match against the Portland Timbers at Starfire Stadium in Tukwila were frustrated much of the night. Down 1-0, Sounders defender Brad Evans was handed a second yellow card and ejected by referee Daniel Radford in the 69th minute. Dempsey entered the match two minutes later and, somehow, Obafemi Martins evened the score 1-1 despite the Sounders being shorthanded. But Martins would leave soon after due to injury, and the Sounders had to play two men down.</p><p>\n \nThe teams headed to extra time, where Portland took a 2-1 lead in the 100th minute. Then, mild-mannered Michael Azira was handed a red card by Radford for elbowing Gaston Fernandez in the face.</p><p>\n \nDempsey admittedly “lost it” at that point. He angrily circled Radford and then, when the referee was distracted, pulled his notebook from his back pocket and tore it to pieces. Dempsey was ejected and the Sounders, down to seven men, would lose the “Red Card Wedding” match 3-1. It’s an act he regrets.</p><p>\n \n“Looking back on it, obviously you would go back and change it,’’ he said in an interview for the book “100 Things Sounders Fans Should Know And Do Before They Die”.</p><p>\n\n“But what happened, happened. You live and you learn. That’s what life is. Everybody’s always trying to live and learn. I learned from it.’’</p>\n",
    "image": "147845_June_62015.jpg",
    "credit": "Erika Schultz / The Seattle Times"
  }
]